In [2]:
import numpy as np
import pandas as pd

In [4]:
data = pd.Series([1,2,3,4,5])
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
data.values

array([1, 2, 3, 4, 5])

In [7]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
data[0]
data[1:3]

1    2
2    3
dtype: int64

In [13]:
data[-1:]

4    5
dtype: int64

In [16]:
data = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
data['c']

3

In [18]:
data = pd.Series(dict(a=1, b=2, c=3, d=4, e=5))
data
data['b':'d']

b    2
c    3
d    4
dtype: int64

In [19]:
series_1 = pd.Series(dict(a=1, b=2, c=3, d=4, e=5)) 
series_2 = pd.Series(dict(a=11, b=12, c=13, d=14, e=15))
df = pd.DataFrame({'column_1':series_1, 'column_2':series_2})
df

   column_1  column_2
a         1        11
b         2        12
c         3        13
d         4        14
e         5        15

In [24]:
df.index
df.columns
df['column_1']
df['column_1']['a']

1

In [25]:
data = df.iloc[2, 1]
data

13

In [34]:
data = {
    'column_1': [1, 2],
    'column_2': [11, 12],
    'column_3': [21, 22]
}

df = pd.DataFrame(data, index=['a', 'b'])
print(df)

   column_1  column_2  column_3
a         1        11        21
b         2        12        22

In [35]:
df.at['a', 'column_1']
df.at['b', 'column_2'] = 100
df

   column_1  column_2  column_3
a         1        11        21
b         2       100        22

In [40]:
df.loc['b':'d', 'column_1']
df.loc['d':'e', 'column_1':'column_2'] = [[0.1, 0.2], [0.3, 0.4]]
df

   column_1  column_2  column_3
a         1        11        21
b         2       100        22

In [47]:
df.iloc[[0, 1], [0, 1]]  # 0番目と1番目の行、0番目と1番目の列を選択
df.iloc[[0, 1], [0, 1]] = [[1001, 1002], [1003, 1004]]  # 0番目と1番目の行、0番目と1番目の列に値を代入
df

   column_1  column_2  column_3
a      1001      1002        21
b      1003      1004        22

In [48]:
import pandas as pd

data = {
    'column_1': [1, 2],
    'column_2': [11, 12],
    'column_3': [21, 22]
}

df = pd.DataFrame(data, index=['a', 'b'])

# 'a'行、'column_1'列に3.1を代入
df.at['a', 'column_1'] = 3.1

# 'a'行、'column_2'列に1.4を代入
df.at['a', 'column_2'] = 1.4

# 'b'行、'column_1'列に2.2を代入
df.at['b', 'column_1'] = 2.2

# 'b'行、'column_2'列に6.8を代入
df.at['b', 'column_2'] = 6.8

df

/tmp/ipykernel_3737/3834899965.py:12: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '3.1' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.at['a', 'column_1'] = 3.1
/tmp/ipykernel_3737/3834899965.py:15: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.4' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.at['a', 'column_2'] = 1.4

   column_1  column_2  column_3
a       3.1       1.4        21
b       2.2       6.8        22

In [50]:
df.to_csv('df_data.csv')
df2.to_excel('df2_data.xlsx')
df3 = pd.read_csv('df_data.csv')
df4 = pd.read_excel('df2_data.xlsx')
df3
df4

  Unnamed: 0  col_1  col_2
0          a      1      2
1          b     11     12
2          c     21     22

In [51]:
df3 = pd.read_csv('df_data.csv', index_col=0)
df4 = pd.read_excel('df2_data.xlsx', index_col=0)

df3
df4

   col_1  col_2
a      1      2
b     11     12
c     21     22